## 2.1 Data Types

In [1]:
# Datatype 
x = 1 + 1
type(x)

int

In [2]:
x = 2.0
type(x)

float

In [3]:
# String
string = 'Okanagan'
print(string)

Okanagan

In [4]:
type(x)

float

In [5]:
5 < 7

True

In [6]:
five = 5
seven = 7
five < seven

True

In [7]:
5.0 > 5

False

In [8]:
# List
list1 = []
list1

[]

In [9]:
list2 = [1, 'UBC', 100]
list2

[1, 'UBC', 100]

In [10]:
len(list1)

0

In [11]:
len(list2)

3

In [12]:
# Indexing Example - we will talk more about this later on
list2[2]

100

In [13]:
list2[1]

'UBC'

In [14]:
type(list2)

list

In [15]:
type(list2[1])

str

In [16]:
# Dictionary - mapping between values
house = {'bedrooms': 3, 'bathrooms': 2, 
         'city': 'Kelowna', 'price': 2499999}

In [17]:
course = {'Data Science': ['DATA100', 'DATA200', 'DATA300'],
            'Science': ['SCIENCE100', 'SCIENCE200', 'SCIENCE300']}

In [18]:
house['price']

2499999

In [19]:
course['Data Science']

['DATA100', 'DATA200', 'DATA300']

In [20]:
# Loops

for n in [0, 1, 5, 2, -5]:
    # this is inside the loop
    print("The number is", n, "and its squared value is", n**2)
# this is outside the loop

The number is 0 and its squared value is 0
The number is 1 and its squared value is 1
The number is 5 and its squared value is 25
The number is 2 and its squared value is 4
The number is -5 and its squared value is 25

In [21]:
## Loop
s = "Python"
for c in s:
    print("Gimme a " + c + "!")

Gimme a P!
Gimme a y!
Gimme a t!
Gimme a h!
Gimme a o!
Gimme a n!

In [22]:
# range(10) sets values 0-9, because recall Python starts at 0, not 1
for i in range(10):
    print(i)

0
1
2
3
4
5
6
7
8
9

In [23]:
for i in range(0,10):
    print(i)

0
1
2
3
4
5
6
7
8
9

In [24]:
for i in range(1,11):
    print(i)

1
2
3
4
5
6
7
8
9
10

In [25]:
#(start,end,increments)
for i in range(0,101,10):
    print(i)

0
10
20
30
40
50
60
70
80
90
100

In [26]:
n = 3
while n > 0:
    print(n)
    n = n - 1
print("Smile!")

3
2
1
Smile!

In [27]:
letter_list = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i']
number_list = [1, 2, 3, 4, 5, 6, 7, 8, 9]
import pandas as pd
df = pd.DataFrame(
    {'Letters': letter_list,
     'Numbers': number_list})

df

  Letters  Numbers
0       a        1
1       b        2
2       c        3
3       d        4
4       e        5
5       f        6
6       g        7
7       h        8
8       i        9

In [28]:
df1 = pd.DataFrame({'x' : [1., 2., 3., 4.],
                   'y' : [4., 3., 2., 1.],
                   'z' : [1, 2, 3, 4]})
df1

     x    y  z
0  1.0  4.0  1
1  2.0  3.0  2
2  3.0  2.0  3
3  4.0  1.0  4

## 2.2 Importing Data

In [29]:
import pandas as pd # we nickname it pd to save time when calling it later

In [30]:
url = 'https://raw.githubusercontent.com/jstaf/gapminder/master/gapminder/gapminder.csv'
df = pd.read_csv(url)

In [31]:
df.head()

       country continent  year  lifeExp       pop   gdpPercap
0  Afghanistan      Asia  1952   28.801   8425333  779.445314
1  Afghanistan      Asia  1957   30.332   9240934  820.853030
2  Afghanistan      Asia  1962   31.997  10267083  853.100710
3  Afghanistan      Asia  1967   34.020  11537966  836.197138
4  Afghanistan      Asia  1972   36.088  13079460  739.981106

In [32]:
df.head(3)

       country continent  year  lifeExp       pop   gdpPercap
0  Afghanistan      Asia  1952   28.801   8425333  779.445314
1  Afghanistan      Asia  1957   30.332   9240934  820.853030
2  Afghanistan      Asia  1962   31.997  10267083  853.100710

In [33]:
df.tail()

       country continent  year  lifeExp       pop   gdpPercap
1699  Zimbabwe    Africa  1987   62.351   9216418  706.157306
1700  Zimbabwe    Africa  1992   60.377  10704340  693.420786
1701  Zimbabwe    Africa  1997   46.809  11404948  792.449960
1702  Zimbabwe    Africa  2002   39.989  11926563  672.038623
1703  Zimbabwe    Africa  2007   43.487  12311143  469.709298

In [34]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1704 entries, 0 to 1703
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   country    1704 non-null   object
 1   continent  1704 non-null   object
 2   year       1704 non-null   int64
 3   lifeExp    1704 non-null   float64
 4   pop        1704 non-null   int64
 5   gdpPercap  1704 non-null   float64
dtypes: float64(2), int64(2), object(2)
memory usage: 80.0+ KB

In [35]:
df.describe()

             year      lifeExp           pop      gdpPercap
count  1704.00000  1704.000000  1.704000e+03    1704.000000
mean   1979.50000    59.474439  2.960121e+07    7215.327081
std      17.26533    12.917107  1.061579e+08    9857.454543
min    1952.00000    23.599000  6.001100e+04     241.165876
25%    1965.75000    48.198000  2.793664e+06    1202.060309
50%    1979.50000    60.712500  7.023596e+06    3531.846988
75%    1993.25000    70.845500  1.958522e+07    9325.462346
max    2007.00000    82.603000  1.318683e+09  113523.132900

In [36]:
df.country.value_counts()

Afghanistan          12
Pakistan             12
New Zealand          12
Nicaragua            12
Niger                12
                     ..
Eritrea              12
Equatorial Guinea    12
El Salvador          12
Egypt                12
Zimbabwe             12
Name: country, Length: 142, dtype: int64

In [37]:
df.max()

country         Zimbabwe
continent        Oceania
year                2007
lifeExp           82.603
pop           1318683096
gdpPercap    113523.1329
dtype: object

In [38]:
df.groupby('country').max()

                   continent  year  lifeExp       pop     gdpPercap
country
Afghanistan             Asia  2007   43.828  31889923    978.011439
Albania               Europe  2007   76.423   3600523   5937.029526
Algeria               Africa  2007   72.301  33333216   6223.367465
Angola                Africa  2007   42.731  12420476   5522.776375
Argentina           Americas  2007   75.320  40301927  12779.379640
...                      ...   ...      ...       ...           ...
Vietnam                 Asia  2007   74.249  85262356   2441.576404
West Bank and Gaza      Asia  2007   73.422   4018332   7110.667619
Yemen, Rep.             Asia  2007   62.698  22211743   2280.769906
Zambia                Africa  2007   51.821  11746035   1777.077318
Zimbabwe              Africa  2007   62.351  12311143    799.362176

[142 rows x 5 columns]

In [39]:
df.groupby(['country', 'year']).mean('lifeExp')

                  lifeExp         pop   gdpPercap
country     year
Afghanistan 1952   28.801   8425333.0  779.445314
            1957   30.332   9240934.0  820.853030
            1962   31.997  10267083.0  853.100710
            1967   34.020  11537966.0  836.197138
            1972   36.088  13079460.0  739.981106
...                   ...         ...         ...
Zimbabwe    1987   62.351   9216418.0  706.157306
            1992   60.377  10704340.0  693.420786
            1997   46.809  11404948.0  792.449960
            2002   39.989  11926563.0  672.038623
            2007   43.487  12311143.0  469.709298

[1704 rows x 3 columns]

## 2.3 Packages

In [40]:
# N/A